; domain
(define (domain industrial_manufacturing)
    (:requirements :strips :typing)
    (:types location box content agent workstation type carrier place - object)

    (:predicates
        (connected ?loc1 ?loc2 - location)
        (content_at_loc ?content - content ?loc - location)
        (box_at_loc ?box - box ?loc - location)
        (agent_at_loc ?agent - agent ?loc - location)
        (ws_at_loc ?ws - workstation ?loc - location)
        (is_type ?content - content ?t - type)
        (empty_box ?box - box)
        (filled_box ?box - box ?content - content)
        (box_at_ws ?box - box ?ws - workstation)
        (content_type_at_ws ?t - type ?ws - workstation)

        (box_at_place ?box - box ?place - place)
        (empty_place ?place - place)
        (place_at_carrier ?place - place ?carrier - carrier)
        (carrier_at_agent ?carrier - carrier ?agent - agent)
    )

    (:action pick_up
        :parameters (?loc - location ?box - box ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (agent_at_loc ?agent ?loc)
            (box_at_loc ?box ?loc)
            (carrier_at_agent ?carrier ?agent)
            (place_at_carrier ?place ?carrier)
            (empty_place ?place)
        )
        :effect (and
            (box_at_place ?box ?place)
            (not (empty_place ?place))
            (not (box_at_loc ?box ?loc))
        )
    )

    (:action move
        :parameters (?from ?to - location ?agent - agent)
        :precondition (and
            (connected ?from ?to)
            (agent_at_loc ?agent ?from)
        )
        :effect (and
            (not (agent_at_loc ?agent ?from))
            (agent_at_loc ?agent ?to)
        )
    )

    (:action deliver
        :parameters (
            ?box - box
            ?ws - workstation
            ?location - location
            ?agent - agent
            ?carrier - carrier
            ?place - place
        )
        :precondition (and
            (ws_at_loc ?ws ?location)
            (agent_at_loc ?agent ?location)
            (carrier_at_agent ?carrier ?agent)
            (place_at_carrier ?place ?carrier)
            (box_at_place ?box ?place)
        )
        :effect (and
            (not (box_at_place ?box ?place))
            (empty_place ?place)
            (box_at_ws ?box ?ws)
        )
    )

    (:action fill
        :parameters (
            ?box - box
            ?content - content
            ?loc - location
            ?agent - agent
            ?carrier - carrier
            ?place - place
        )
        :precondition (and
            (content_at_loc ?content ?loc)
            (agent_at_loc ?agent ?loc)
            (carrier_at_agent ?carrier ?agent)
            (place_at_carrier ?place ?carrier)
            (box_at_place ?box ?place)
            (empty_box ?box)
        )
        :effect (and
            (not (empty_box ?box))
            (filled_box ?box ?content)
            (not (content_at_loc ?content ?loc))
        )
    )

    (:action empty
        :parameters (?box - box ?content - content ?t - type ?ws - workstation ?agent - agent ?loc - location)
        :precondition (and
            (is_type ?content ?t)
            (box_at_ws ?box ?ws)
            (ws_at_loc ?ws ?loc)
            (filled_box ?box ?content)
            (agent_at_loc ?agent ?loc)
        )
        :effect (and
            (not (filled_box ?box ?content))
            (empty_box ?box)
            (box_at_loc ?box ?loc)
            (not (box_at_ws ?box ?ws))
            (content_type_at_ws ?t ?ws)
        )
    )
)

; problem
(define (problem instance2) (:domain industrial_manufacturing)
  (:objects
    ; define the world
    cw loc1 loc2 - location
    ws1 ws2 ws3 ws4 ws5 - workstation
    b1 b2 b3 b4 - box
    a1 a2 - agent
    c1 c2 - carrier
    p11 p12 p21 p22 - place
    valve1 valve2 bolt1 bolt2 hammer1 hammer2 - content
    valve bolt hammer - type
  )
  (:init
    ; define the type of content
    (is_type valve1 valve)
    (is_type valve2 valve)
    (is_type bolt1 bolt)
    (is_type bolt2 bolt)
    (is_type hammer1 hammer)
    (is_type hammer2 hammer)

    ; define the empty box located at central_warehouse
    (box_at_loc b1 cw)
    (box_at_loc b2 cw)
    (box_at_loc b3 cw)
    (box_at_loc b4 cw)
    (empty_box b1)
    (empty_box b2)
    (empty_box b3)
    (empty_box b4)

    ; define content located at central_warehouse
    (content_at_loc valve1 cw)
    (content_at_loc valve2 cw)
    (content_at_loc bolt1 cw)
    (content_at_loc bolt2 cw)
    (content_at_loc hammer1 cw)
    (content_at_loc hammer2 cw)

    ; define workstation located at central_warehouse
    (ws_at_loc ws1 loc1)
    (ws_at_loc ws2 loc1)
    (ws_at_loc ws3 loc2)
    (ws_at_loc ws4 loc2)
    (ws_at_loc ws5 loc2)

    ; define workstation located at central_warehouse
    (connected cw loc1)
    (connected cw loc2)
    (connected loc1 cw)
    (connected loc2 cw)

    ; define agents located initially located at central_warehouse
    (agent_at_loc a1 cw)
    (carrier_at_agent c1 a1)
    (place_at_carrier p11 c1)
    (place_at_carrier p12 c1)
    (empty_place p11)
    (empty_place p12)
    (agent_at_loc a2 cw)
    (carrier_at_agent c2 a2)
    (place_at_carrier p21 c2)
    (place_at_carrier p22 c2)
    (empty_place p21)
    (empty_place p22)
  )
  (:goal
    ; define goals to satisfied
    (and
      (content_type_at_ws bolt ws1)
      (content_type_at_ws valve ws1)
      (content_type_at_ws bolt ws2)
      (content_type_at_ws hammer ws3)
      (content_type_at_ws valve ws3)
      (content_type_at_ws hammer ws4)
    )
   )
  )

; plan
1. (move cw loc1 a1)
   deleted: (agent_at_loc a1 cw)
   added: (agent_at_loc a1 loc1)
   goals met: 0 of 6
2. (pick_up cw b1 a2 c2 p21)
   deleted: (empty_place p21) (box_at_loc b1 cw)
   added: (box_at_place b1 p21)
   goals met: 0 of 6
3. (fill b1 bolt1 cw a2 c2 p21)
   deleted: (empty_box b1) (content_at_loc bolt1 cw)
   added: (filled_box b1 bolt1)
   goals met: 0 of 6
4. (move cw loc1 a2)
   deleted: (agent_at_loc a2 cw)
   added: (agent_at_loc a2 loc1)
   goals met: 0 of 6
5. (deliver b1 ws2 loc1 a2 c2 p21)
   deleted: (box_at_place b1 p21)
   added: (empty_place p21) (box_at_ws b1 ws2)
   goals met: 0 of 6
6. (empty b1 bolt1 bolt ws2 a1 loc1)
   deleted: (filled_box b1 bolt1) (box_at_ws b1 ws2)
   added: (empty_box b1) (box_at_loc b1 loc1) (content_type_at_ws bolt ws2)
   goals met: 1 of 6
7. (pick_up loc1 b1 a1 c1 p12)
   deleted: (empty_place p12) (box_at_loc b1 loc1)
   added: (box_at_place b1 p12)
   goals met: 1 of 6
8. (move loc1 cw a1)
   deleted: (agent_at_loc a1 loc1)
   added: (agent_at_loc a1 cw)
   goals met: 1 of 6
9. (fill b1 valve1 cw a1 c1 p12)
   deleted: (empty_box b1) (content_at_loc valve1 cw)
   added: (filled_box b1 valve1)
   goals met: 1 of 6
10. (move cw loc1 a1)
   deleted: (agent_at_loc a1 cw)
   added: (agent_at_loc a1 loc1)
   goals met: 1 of 6
11. (deliver b1 ws1 loc1 a1 c1 p12)
   deleted: (box_at_place b1 p12)
   added: (empty_place p12) (box_at_ws b1 ws1)
   goals met: 1 of 6
12. (empty b1 valve1 valve ws1 a2 loc1)
   deleted: (filled_box b1 valve1) (box_at_ws b1 ws1)
   added: (empty_box b1) (box_at_loc b1 loc1) (content_type_at_ws valve ws1)
   goals met: 2 of 6
13. (pick_up loc1 b1 a1 c1 p12)
   deleted: (empty_place p12) (box_at_loc b1 loc1)
   added: (box_at_place b1 p12)
   goals met: 2 of 6
14. (move loc1 cw a1)
   deleted: (agent_at_loc a1 loc1)
   added: (agent_at_loc a1 cw)
   goals met: 2 of 6
15. (fill b1 bolt2 cw a1 c1 p12)
   deleted: (empty_box b1) (content_at_loc bolt2 cw)
   added: (filled_box b1 bolt2)
   goals met: 2 of 6
16. (move cw loc1 a1)
   deleted: (agent_at_loc a1 cw)
   added: (agent_at_loc a1 loc1)
   goals met: 2 of 6
17. (deliver b1 ws1 loc1 a1 c1 p12)
   deleted: (box_at_place b1 p12)
   added: (empty_place p12) (box_at_ws b1 ws1)
   goals met: 2 of 6
18. (empty b1 bolt2 bolt ws1 a2 loc1)
   deleted: (filled_box b1 bolt2) (box_at_ws b1 ws1)
   added: (empty_box b1) (box_at_loc b1 loc1) (content_type_at_ws bolt ws1)
   goals met: 3 of 6
19. (move loc1 cw a1)
   deleted: (agent_at_loc a1 loc1)
   added: (agent_at_loc a1 cw)
   goals met: 3 of 6
20. (move cw loc2 a1)
   deleted: (agent_at_loc a1 cw)
   added: (agent_at_loc a1 loc2)
   goals met: 3 of 6
21. (move loc1 cw a2)
   deleted: (agent_at_loc a2 loc1)
   added: (agent_at_loc a2 cw)
   goals met: 3 of 6
22. (pick_up cw b3 a2 c2 p21)
   deleted: (empty_place p21) (box_at_loc b3 cw)
   added: (box_at_place b3 p21)
   goals met: 3 of 6
23. (fill b3 valve2 cw a2 c2 p21)
   deleted: (empty_box b3) (content_at_loc valve2 cw)
   added: (filled_box b3 valve2)
   goals met: 3 of 6
24. (pick_up cw b2 a2 c2 p22)
   deleted: (empty_place p22) (box_at_loc b2 cw)
   added: (box_at_place b2 p22)
   goals met: 3 of 6
25. (fill b2 hammer2 cw a2 c2 p22)
   deleted: (empty_box b2) (content_at_loc hammer2 cw)
   added: (filled_box b2 hammer2)
   goals met: 3 of 6
26. (move cw loc2 a2)
   deleted: (agent_at_loc a2 cw)
   added: (agent_at_loc a2 loc2)
   goals met: 3 of 6
27. (deliver b3 ws3 loc2 a2 c2 p21)
   deleted: (box_at_place b3 p21)
   added: (empty_place p21) (box_at_ws b3 ws3)
   goals met: 3 of 6
28. (empty b3 valve2 valve ws3 a1 loc2)
   deleted: (filled_box b3 valve2) (box_at_ws b3 ws3)
   added: (empty_box b3) (box_at_loc b3 loc2) (content_type_at_ws valve ws3)
   goals met: 4 of 6
29. (deliver b2 ws4 loc2 a2 c2 p22)
   deleted: (box_at_place b2 p22)
   added: (empty_place p22) (box_at_ws b2 ws4)
   goals met: 4 of 6
30. (empty b2 hammer2 hammer ws4 a2 loc2)
   deleted: (filled_box b2 hammer2) (box_at_ws b2 ws4)
   added: (empty_box b2) (box_at_loc b2 loc2) (content_type_at_ws hammer ws4)
   goals met: 5 of 6
31. (move loc2 cw a2)
   deleted: (agent_at_loc a2 loc2)
   added: (agent_at_loc a2 cw)
   goals met: 5 of 6
32. (pick_up cw b4 a2 c2 p21)
   deleted: (empty_place p21) (box_at_loc b4 cw)
   added: (box_at_place b4 p21)
   goals met: 5 of 6
33. (fill b4 hammer1 cw a2 c2 p21)
   deleted: (empty_box b4) (content_at_loc hammer1 cw)
   added: (filled_box b4 hammer1)
   goals met: 5 of 6
34. (move cw loc2 a2)
   deleted: (agent_at_loc a2 cw)
   added: (agent_at_loc a2 loc2)
   goals met: 5 of 6
35. (deliver b4 ws3 loc2 a2 c2 p21)
   deleted: (box_at_place b4 p21)
   added: (empty_place p21) (box_at_ws b4 ws3)
   goals met: 5 of 6
36. (empty b4 hammer1 hammer ws3 a1 loc2)
   deleted: (filled_box b4 hammer1) (box_at_ws b4 ws3)
   added: (empty_box b4) (box_at_loc b4 loc2) (content_type_at_ws hammer ws3)
   goals met: 6 of 6
